# SQL LAB

## Before you do labs in class, try your best to write and test your sql code on labs

## Your db account

- db hostname: dm.hufs.ac.kr:3306
- id: s학번
- db name: s학번db    (학번은 자신의 학번)
- password: ***********

In [ ]:
s = 0
for _ in range(100):
    s += 0.01
    
print(s)

1.0000000000000007

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
!pip install pymysql

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: pymysql in /usr/local/lib/python3.7/dist-packages (1.0.2)

In [ ]:
import getpass
user = 's202200001'
password = getpass.getpass()
host='dm.hufs.ac.kr'
database = 's202200001db'
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: s202003930@s202003930db'

In [ ]:
%sql show databases;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
2 rows affected.

[('information_schema',), ('s202200001db',)]

In [ ]:
%sql show databases

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
2 rows affected.

[('information_schema',), ('s202200001db',)]

In [ ]:
%sql use s202200001db

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

In [ ]:
%%sql 

select * from EMPLOYEE

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [ ]:
%%sql 

select * 
from EMPLOYEE;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [ ]:
%sql select * from DEPARTMENT;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
3 rows affected.

[('Headquarters', 1, '888665555', datetime.date(1981, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1995, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1988, 5, 22))]

In [ ]:
%%sql

select *
from EMPLOYEE;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [ ]:
%sql show databases;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
2 rows affected.

[('information_schema',), ('s202100001db',)]

In [ ]:
%sql use s202100001db;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

show tables;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
11 rows affected.

[('DEPARTMENT',),
 ('DEPENDENT',),
 ('DEPT_LOCATIONS',),
 ('EMPLOYEE',),
 ('PROJECT',),
 ('WORKS_ON',),
 ('courses',),
 ('dept',),
 ('emp',),
 ('students',),
 ('takes',)]

In [ ]:
%sql show tables;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
11 rows affected.

[('DEPARTMENT',),
 ('DEPENDENT',),
 ('DEPT_LOCATIONS',),
 ('EMPLOYEE',),
 ('PROJECT',),
 ('WORKS_ON',),
 ('courses',),
 ('dept',),
 ('emp',),
 ('students',),
 ('takes',)]

In [ ]:
%sql desc DEPARTMENT;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
4 rows affected.

[('Dname', 'varchar(15)', 'NO', 'UNI', None, ''),
 ('Dnumber', 'int(11)', 'NO', 'PRI', None, ''),
 ('Mgrssn', 'char(9)', 'YES', 'MUL', None, ''),
 ('Mgrstartdate', 'date', 'YES', '', None, '')]

## Create companydb and load data
## This is done only ONCE; Do NOT run this cell 
## Whenever database is corrupted, run this cell

In [ ]:
%%sql

SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;

DROP TABLE IF EXISTS DEPENDENT;
DROP TABLE IF EXISTS WORKS_ON;
DROP TABLE IF EXISTS PROJECT;
DROP TABLE IF EXISTS DEPT_LOCATIONS;
DROP TABLE IF EXISTS DEPARTMENT;
DROP TABLE IF EXISTS EMPLOYEE;

CREATE TABLE EMPLOYEE
(       Fname VARCHAR(15) NOT NULL,
        Minit CHAR,
        Lname VARCHAR(15) NOT NULL,
        Ssn CHAR(9) NOT NULL,
        Bdate DATE,
        Address VARCHAR(30),
        Sex CHAR,
        Salary DECIMAL(10, 2),
        Superssn CHAR(9),
        Dno INT,
        PRIMARY KEY (Ssn),
        FOREIGN KEY (Superssn) 
                REFERENCES EMPLOYEE(Ssn) 
                ON DELETE SET NULL
                ON UPDATE CASCADE,
        FOREIGN KEY (Dno) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;

CREATE TABLE DEPARTMENT
(       Dname VARCHAR(15) NOT NULL,
        Dnumber INT NOT NULL,
        Mgrssn CHAR(9),
        Mgrstartdate DATE,
        PRIMARY KEY (Dnumber),
        UNIQUE (Dname),
        FOREIGN KEY (Mgrssn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPT_LOCATIONS
(       Dnumber INT NOT NULL,
        Dlocation VARCHAR(15) NOT NULL,
        PRIMARY KEY (Dnumber, Dlocation),
        FOREIGN KEY (Dnumber)
                REFERENCES DEPARTMENT(Dnumber) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE PROJECT
(       Pname VARCHAR(15) NOT NULL,
        Pnumber INT NOT NULL,
        Plocation VARCHAR(15),
        Dnum INT,
        PRIMARY KEY (Pnumber),
        UNIQUE (Pname),
        FOREIGN KEY (Dnum) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE WORKS_ON
(       Essn CHAR(9) NOT NULL,
        Pno INT NOT NULL,
        Hours DECIMAL(3, 1) ,
        PRIMARY KEY (Essn, Pno),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Pno) 
                REFERENCES PROJECT(Pnumber)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPENDENT
(       Essn CHAR(9) NOT NULL,
        Dependent_name VARCHAR(15) NOT NULL,
        Sex CHAR,
        Bdate DATE,
        Relationship VARCHAR(8),
        PRIMARY KEY (Essn, Dependent_name),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


insert into EMPLOYEE values
        ("John", "B", "Smith", "123456789","1965-01-09", "731-Fondren-Houston-TX", "M", 30000, "333445555", 5),
        ("Franklin", "T", "Wong", "333445555","1955-12-08", "638-Voss-Houston-TX", "M", 40000, "888665555", 5),
        ("Alicia", "J", "Zelaya", "999887777", "1968-01-19", "3321-Castle-Spring-TX", "F", 25000, "987654321", 4),
        ("Jennifer", "S", "Wallace", "987654321", "1941-06-20", "291-Berry-Bellaire-TX", "F", 43000, "888665555", 4),
        ("Ramesh", "K", "Narayan", "666884444", "1962-09-15", "975-Fire-Oak-Humble-TX", "M", 38000, "333445555", 5),
        ("Joyce", "A", "English", "453453453", "1972-07-31", "5631-Rice-Houston-TX", "F", 25000, "333445555", 5),
        ("Ahmad", "V", "Jabbar", "987987987", "1969-03-29", "980-Dallas-Houston-TX", "M", 25000, "987654321", 4),
        ("James", "E", "Borg", "888665555", "1937-11-10", "450-Stone-Houston-TX", "M", 55000, NULL, 1);


insert into DEPENDENT  values 
        (333445555, "Alice", "F","1986-04-05", "Daughter"),
        (333445555, "Theodore", "M","1983-10-25", "Son"),
        (333445555, "Joy", "F","1958-05-03", "Spouse"),
        (987654321, "Abner", "M","1942-02-28", "Spouse"),
        (123456789, "Michael", "M","1988-01-04", "Son"),
        (123456789, "Alice", "F", "1988-12-30", "Daughter"),
        (123456789, "Elizabeth", "F", "1967-05-05", "Spouse");


insert into DEPARTMENT values 
        ("Research", 5, 333445555,"1988-05-22"),
        ("Administration", 4, 987654321,"1995-01-01"),
        ("Headquarters", 1, 888665555,"1981-06-19");

insert into DEPT_LOCATIONS values 
        (1, "Houston"),
        (4, "Stafford"),
        (5, "Bellaire"),
        (5, "Sugarland"),
        (5, "Houston");


insert into PROJECT values 
        ("ProductX", 1, "Bellaire", 5),
        ("ProductY", 2, "Sugarland", 5),
        ("ProductZ", 3, "Houston", 5),
        ("Computerization", 10, "Stafford", 4),
        ("Reorganization", 20, "Houston", 1),
        ("Newbenefits", 30, "Stafford", 4);


insert into WORKS_ON values
        (123456789, 1, 32.5),
        (123456789, 2, 7.5),
        (666884444, 3, 40.0),
        (453453453, 1, 20.0),
        (453453453, 2, 20.0),
        (333445555, 2, 10.0),
        (333445555, 3, 10.0),
        (333445555, 10, 10.0),
        (333445555, 20, 10.0),
        (999887777, 30, 30.0),
        (999887777, 10, 10.0),
        (987987987, 10, 35.0),
        (987987987, 30, 5.0),
        (987654321, 30, 20.0),
        (987654321, 20, 15.0),
        (888665555, 20, NULL); 

SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
8 rows affected.
7 rows affected.
3 rows affected.
5 rows affected.
6 rows affected.
16 rows affected.
0 rows affected.
0 rows affected.

[]

In [ ]:
%sql select * from EMPLOYEE;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [ ]:
%sql select * from PROJECT;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
6 rows affected.

[('ProductX', 1, 'Bellaire', 5),
 ('ProductY', 2, 'Sugarland', 5),
 ('ProductZ', 3, 'Houston', 5),
 ('Computerization', 10, 'Stafford', 4),
 ('Reorganization', 20, 'Houston', 1),
 ('Newbenefits', 30, 'Stafford', 4)]

In [ ]:
%%sql

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'sdfasdf\na\nsdf\nasdf' at line 1")
[SQL: sdfasdf
a
sdf
asdf]
(Background on this error at: https://sqlalche.me/e/14/f405)

## create table 
```
emp(ssn)
PK: ssn
```

In [ ]:
%sql drop table if exists emp;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

In [ ]:
%sql drop table if exists dept;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

In [ ]:
%%sql

create table emp (
    ssn char(9) primary key
) engine=InnoDB;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

## create table 
```
dept(dname, dnumbr, mgrssn, mgrstartdate)
K: dname, dnumber
PK: dnumber
FK: mgrssn -> emp
```

In [ ]:
%%sql

create table dept (
    dname varchar(20) not null,
    dnumber integer not null,
    mgrssn char(9),
    mgrstartdate date,
    primary key (dnumber),
    unique (dname),
    foreign key (mgrssn) references emp(ssn) 
        on delete cascade
) engine = InnoDB;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

In [ ]:
%sql desc emp;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('ssn', 'char(9)', 'NO', 'PRI', None, '')]

In [ ]:
%sql desc dept;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
4 rows affected.

[('dname', 'varchar(20)', 'NO', 'UNI', None, ''),
 ('dnumber', 'int(11)', 'NO', 'PRI', None, ''),
 ('mgrssn', 'char(9)', 'YES', 'MUL', None, ''),
 ('mgrstartdate', 'date', 'YES', '', None, '')]

In [ ]:
%%sql 

insert into emp values( '333445555' );
insert into emp values( '987654321');
insert into emp values( '886655555' );

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%sql select * from emp;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
3 rows affected.

[('333445555',), ('886655555',), ('987654321',)]

In [ ]:
%%sql 

insert into emp values( '886655555' );

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db

IntegrityError: ignored

In [ ]:
%sql select * from emp;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
3 rows affected.

[('333445555',), ('886655555',), ('987654321',)]

In [ ]:
%sql select * from dept;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
4 rows affected.

[('Headquarters', 1, '886655555', datetime.date(1981, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1995, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1988, 5, 2)),
 ('Researchx', 10, '333445555', datetime.date(1988, 5, 2))]

In [ ]:
%%sql 

insert into dept values ('Research', 5, '333445555', '1988-05-02');
insert into dept values ('Administration', 4, '987654321', '1995-01-01');
insert into dept values ('Headquarters', 1, '886655555', '1981-06-19');

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%sql select * from emp;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
3 rows affected.

[('333445555',), ('886655555',), ('987654321',)]

In [ ]:
%%sql 

insert into dept values ('Researchx', 10, '333445555', '1988-05-02');

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[]

In [ ]:
%%sql

select * from emp;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

select * from dept;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('Research', 5, '333445555', datetime.date(1988, 5, 2))]

In [ ]:
%%sql

delete from emp;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
3 rows affected.

[]

In [ ]:
%sql select * from dept;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

## Exercises
```
students(sid, ssn, sname)
K: sid, ssn
sid, ssn, sname: not null
PK: sid

courses(cid, cname)
K: cid
PK: cid

takes(sid, cid, grade)
PK: (sid, cid)
FK: sid -> students, on delete cascade
FK: cid -> courses, on delete restrict
```

In [ ]:
%%sql 

drop table courses;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

In [ ]:
%%sql

create table students (
  sid char(10) primary key,
  ssn char(12) not null unique,
  sname char(10) not null
)

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

In [ ]:
%%sql

create table courses (
    cid char(10) primary key,
    cname varchar(50) not null
)

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

In [ ]:
%%sql

create table takes (
    sid char(10),
    cid char(10),
    grade char(2),
    primary key (sid, cid),
    foreign key (sid) references students(sid) on delete cascade,
    foreign key (cid) references courses(cid) on delete restrict    
)

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
0 rows affected.

[]

## Try this: MySQL comment

In [ ]:
%%sql

select * 
from EMPLOYEE
where Salary >= 20000
-- comment until the end of line
/*     and dno = 5   */

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [ ]:
%%sql 

insert into emp values( '333445555' );
insert into emp values( '987654321');
insert into emp values( '886655555' );

In [ ]:
%%sql 

-- insert into dept values ('Research', 5, '333445551', '1988-05-02');
insert into dept values ('Research', 5, '333445555', '1988-05-02');
insert into dept values ('Administration', 4, '987654321', '1995-01-01');
insert into dept values ('Headquarters', 1, '886655555', '1981-06-19');

In [ ]:
%%sql 

drop table ttt;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

create table ttt(i int check( 1 <= i and i <= 4));

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql 

insert into ttt values (1);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[]

In [ ]:
%%sql 

insert into ttt values (10);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[]

In [ ]:
%%sql

select * from ttt;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
2 rows affected.

[(1,), (10,)]

salary가 50000이상이고 1961년 1월 1일 이후에 태어난 직원의 lname?

1.   테이블 이름은 case-sensitive
2.   칼럼 이름은 case-insensitive

In [ ]:
%sql desc EMPLOYEE;

*salary가* 20000이상 50000이상이하인 직원의 lname?

In [ ]:
%%sql

select e.lname
from EMPLOYEE e
where e.salary between 20000 and 50000

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
7 rows affected.

[('Smith',),
 ('Wong',),
 ('English',),
 ('Narayan',),
 ('Wallace',),
 ('Jabbar',),
 ('Zelaya',)]

In [ ]:
%sql select sin(0) from dual;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[(0.0,)]

In [ ]:
%sql select adddate(now(), 100) as anniversaryday;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[(datetime.datetime(2022, 2, 17, 11, 19, 58),)]

In [ ]:
%sql select * from EMPLOYEE where dnO = 5;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
4 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5)]

In [ ]:
%%sql

SELECT Lname
FROM EMPLOYEE
WHERE Salary >= 30000 and date'1961-1-1';

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
5 rows affected.

[('Smith',), ('Wong',), ('Narayan',), ('Borg',), ('Wallace',)]

In [ ]:
%%sql

SELECT Lname
FROM EMPLOYEE
WHERE Salary >= 30000 AND BDATE > date'..........';

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('Smith',),
 ('Wong',),
 ('English',),
 ('Narayan',),
 ('Borg',),
 ('Wallace',),
 ('Jabbar',),
 ('Zelaya',)]

**11/9 DBA**

## Try this:
```
select * 
from EMPLOYEE e, DEPARTMENT d, PROJECT p
```

In [ ]:
%%sql

select count(*) 
from EMPLOYEE, DEPARTMENT, PROJECT
where ;

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
1 rows affected.

[(144,)]

## LAB 1: ‘Research’ 부서에서 일하는 모든 종업원들의 이름과 주소를 검색하시오.

In [ ]:
%%sql

select e.lname, e.address
from EMPLOYEE e, DEPARTMENT d
where d.dname = 'Research' and e.dno = d.dnumber

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
4 rows affected.

[('Smith', '731-Fondren-Houston-TX'),
 ('Wong', '638-Voss-Houston-TX'),
 ('English', '5631-Rice-Houston-TX'),
 ('Narayan', '975-Fire-Oak-Humble-TX')]

## LAB 2 :  salary가 30000 이상 50000이하인 직원의 lname?

In [ ]:
%%sql

select lname
from EMPLOYEE
where  Salary >= 30000 and Salary <= 50000;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
4 rows affected.

[('Smith',), ('Wong',), ('Narayan',), ('Wallace',)]

In [ ]:
%%sql

select lname
from EMPLOYEE
where  Salary between 30000 and 50000;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
4 rows affected.

[('Smith',), ('Wong',), ('Narayan',), ('Wallace',)]

## LAB 3: 4번 또는 5번 부서의 남자 직원의 lname?

In [ ]:
%%sql

select lname
from EMPLOYEE
where Sex = 'M' and (Dno = 4 or Dno = 5);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
4 rows affected.

[('Jabbar',), ('Smith',), ('Wong',), ('Narayan',)]

## LAB 4: 5번 부서에 근무하는 직원의 부양가족의 이름?

In [ ]:
%%sql

## LAB 5: 'Research' 부서에 근무하는 직원의 부양가족의 이름?

In [ ]:
%%sql

explain
select t.dependent_name
from EMPLOYEE e, DEPARTMENT d, DEPENDENT t
where e.dno = d.dnumber and e.ssn = t.essn and d.dname = 'Research'

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
3 rows affected.

[(1, 'SIMPLE', 'd', None, 'const', 'PRIMARY,Dname', 'Dname', '62', 'const', 1, 100.0, 'Using index'),
 (1, 'SIMPLE', 'e', None, 'ref', 'PRIMARY,Dno', 'Dno', '5', 'const', 4, 100.0, 'Using index'),
 (1, 'SIMPLE', 't', None, 'ref', 'PRIMARY', 'PRIMARY', '36', 's202200001db.e.Ssn', 1, 100.0, 'Using index')]

## LAB 6: James Borg의 직접 부하직원의 lname은?

In [ ]:
%%sql 

select e.lname
from EMPLOYEE e, EMPLOYEE b  /* S <- E */
where b.lname = 'Borg' and e.superssn = b.ssn

 * mysql+pymysql://s202200001:***@dm.hufs.ac.kr:3306/s202200001db
2 rows affected.

[('Wong',), ('Wallace',)]

In [ ]:
## DBA 11/15

## LAB 7: James Borg의 부하직원과 그 부하직원의 부하직원의 lname를 찾으시오.

In [ ]:
%%sql
(select e.lname
from EMPLOYEE e, EMPLOYEE j
where j.lname = 'Borg' and j.fname = 'James' and j.ssn = e.superssn)
union all
(select f.lname
from EMPLOYEE e, EMPLOYEE j, EMPLOYEE f
where j.lname = 'Borg' and j.fname = 'James' and j.ssn = e.superssn and e.ssn = f.superssn);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
7 rows affected.

[('Wong',),
 ('Wallace',),
 ('Smith',),
 ('English',),
 ('Narayan',),
 ('Jabbar',),
 ('Zelaya',)]

In [ ]:
%%sql
select e2.ssn
from EMPLOYEE e, EMPLOYEE e1, EMPLOYEE e2
where e.Fname='James' and e.Lname='Borg' and e.ssn=e1.superssn and e1.ssn=e2.superssn
union
select e.ssn
from EMPLOYEE e, EMPLOYEE j
where j.lname = 'Borg' and j.fname = 'James' and e.superssn=j.ssn

11/11 DBA

## Try this: DISTINCT

In [ ]:
%sql select sex from EMPLOYEE;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('M',), ('M',), ('F',), ('M',), ('M',), ('F',), ('M',), ('F',)]

In [ ]:
%sql select distinct sex from EMPLOYEE;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
2 rows affected.

[('M',), ('F',)]

### Do we need distinct
```
select distinct salary, ssn from EMPLOYEE;
```

In [ ]:
%%sql

select distinct ssn, salary from EMPLOYEE;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('123456789', Decimal('30000.00')),
 ('333445555', Decimal('40000.00')),
 ('453453453', Decimal('25000.00')),
 ('666884444', Decimal('38000.00')),
 ('888665555', Decimal('55000.00')),
 ('987654321', Decimal('43000.00')),
 ('987987987', Decimal('25000.00')),
 ('999887777', Decimal('25000.00'))]

#### Answer: No

### Do we need distinct
```
select ssn, dname
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;
```

In [ ]:
%%sql

select ssn, dname
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
6 rows affected.

[('888665555', 'Headquarters'),
 ('987654321', 'Administration'),
 ('987654321', 'Administration'),
 ('333445555', 'Research'),
 ('333445555', 'Research'),
 ('333445555', 'Research')]

### Answer: Yes

### Do we need distinct
```
select ssn, pno
from EMPLOYEE e, WORKS_ON, PROJECT p
```

In [ ]:
%%sql

select ssn, pno
from EMPLOYEE e, WORKS_ON, PROJECT p

### Answer: Yes

### Do we need distinct
```
select pnumber
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;
```

### Answer: No

## Try this: UNION과 UNION ALL의 차이

In [ ]:
%%sql

(select ssn from EMPLOYEE) union all (select essn from DEPENDENT);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
15 rows affected.

[('888665555',),
 ('987654321',),
 ('987987987',),
 ('999887777',),
 ('123456789',),
 ('333445555',),
 ('453453453',),
 ('666884444',),
 ('123456789',),
 ('123456789',),
 ('123456789',),
 ('333445555',),
 ('333445555',),
 ('333445555',),
 ('987654321',)]

In [ ]:
%%sql

(select ssn from EMPLOYEE) union (select essn from DEPENDENT);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('888665555',),
 ('987654321',),
 ('987987987',),
 ('999887777',),
 ('123456789',),
 ('333445555',),
 ('453453453',),
 ('666884444',)]

## Try this: MySQL은 intersect와 except를 지원하지 않음

In [ ]:
%%sql

(select ssn from EMPLOYEE) intersect (select essn from DEPENDENT);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'intersect (select essn from DEPENDENT)' at line 1")
[SQL: (select ssn from EMPLOYEE) intersect (select essn from DEPENDENT);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
%%sql

(select ssn from EMPLOYEE) minus (select essn from DEPENDENT);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'minus (select essn from DEPENDENT)' at line 1")
[SQL: (select ssn from EMPLOYEE) minus (select essn from DEPENDENT);]
(Background on this error at: https://sqlalche.me/e/14/f405)

### Use exists instead

In [ ]:
%%sql

select ssn 
from EMPLOYEE e
where not exists (select * from DEPENDENT de where e.ssn = de.essn)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
5 rows affected.

[('888665555',),
 ('987987987',),
 ('999887777',),
 ('453453453',),
 ('666884444',)]

## LAB 8: Smith가 관리자인 projects 또는 Smith가 참여하는 projects

In [ ]:
%%sql
(
  select p.Pname
  from EMPLOYEE e, DEPARTMENT d, PROJECT p
  where e.Lname = 'Smith' and e.Ssn = d.Mgrssn and d.Dnumber = p.Dnum
)
union
(
  select p.Pname
  from EMPLOYEE e, WORKS_ON w, PROJECT p
  where e.Lname = 'Smith' and e.Ssn = w.Essn and w.Pno = p.Pnumber
)

## LAB 9: 1968년 1월 1일 이후 1월달에 태어났고 TX에 주소가 있는 직원은?

In [ ]:
%%sql

select lname
from EMPLOYEE
where bdate like /*     */ and address like /*   */ and bdate >= date'1968-1-1';

In [ ]:
%%sql

select lname
from EMPLOYEE
where bdate like '____-01-__' and address like '%TX%' and bdate >= date'1968-1-1';

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('Zelaya',)]

In [ ]:
%%sql

select lname 
from EMPLOYEE
where bdate like "____-01-__"  and address like "%TX"and bdate >= date '1968-1-1'

## Try this

In [ ]:
%sql select 'cadfasdfadd' like '%a_';

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[(0,)]

In [ ]:
%%sql

select 1+2+3 from dual; -- Oracle style

In [ ]:
%%sql

select 1+2 as t;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[(3,)]

### Look at functions and operators part

https://dev.mysql.com/doc/refman/8.0/en/

In [ ]:
%sql select sha2('pasalalkasJDL;ASDF;ASLDJFASDFJKasdl;AL;SDKMlla1', 256);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('868c385fe247c9d8f9e926ed41cae2e97810be4e00b1c91e54b81a7f57af2cea',)]

In [ ]:
import math

math.log10(2**256)

77.06367888997919

In [ ]:
%sql select sha('password');

In [ ]:
%sql select round(2/3, 2)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[(Decimal('0.67'),)]

In [ ]:
%sql select now();

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[(datetime.datetime(2021, 11, 16, 10, 50, 5),)]

In [ ]:
%sql select 'abc Houston,     TX, abc' regexp 'Houston *, *TX'

In [ ]:
%sql select 'aaaaaabdef' regexp '^(a|b|c)*def$'

In [ ]:
%%sql 

select dname, group_concat(lname) as names_in_dept
from DEPARTMENT d, EMPLOYEE e
where d.dnumber = e.dno
group by dnumber

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
3 rows affected.

[('Headquarters', 'Borg'),
 ('Administration', 'Wallace,Jabbar,Zelaya'),
 ('Research', 'Smith,Wong,English,Narayan')]

In [ ]:
%%sql 

select lname,fname
from EMPLOYEE order by fname limit 3

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
3 rows affected.

[('Jabbar', 'Ahmad'), ('Zelaya', 'Alicia'), ('Wong', 'Franklin')]

In [ ]:
%sql select 1;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[(1,)]

### user-defined variable을 사용하여 삽입 (Embedded SQL도 비슷하게 작동함)

In [ ]:
%%sql

select ssn into @ssn from EMPLOYEE where lname = 'Borg' and fname = 'James';
select pnumber into @pno from PROJECT where pname = 'Computerization';
select @ssn, @pno;

insert into WORKS_ON values (@ssn, @pno, 10);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%sql select * from PROJECT

## Try this: transaction, commit/rollback in mysql client

#### Try this with mysql shell: sqlmagic is always autocommit
#### James Borg를 ProductX 프로젝트에 10시간 참여시킬 것.
```
\sql
\connect s202100001@dm.hufs.ac.kr
```
```
set autocommit=False;
select * from DEPENDENT;
delete from DEPENDENT;
rollback;
select * from DEPENDENT;
```
#### Deletion on DEPENDENT is ROLLBACKED
```
select * from DEPENDENT;
delete from DEPENDENT;
commit;
select * from DEPENDENT;
```
#### Deletion on DEPENDENT is COMMITTED; No way to revive them


## To try with transaction concurrecy control and isolation level, use two mysql shells

**11/16 DBA**

## LAB 10: ProductX에 참여하는 직원의 연봉을 10% 인상하시오.

In [ ]:
%%sql 

update EMPLOYEE
set salary = salary * 1.1
where ssn in (select essn from WORKS_ON, PROJECT where pno = pnumber and pname = 'ProductX')

## LAB 11: James Borg의 부하직원의 연봉을 10% 인상하시오.

In [ ]:
%%sql
/* update 문장의 테이블을 where 절에 사용하면 semantics가 무한 순환 관계가 될 수 있음. 두 개의 SQL을 사용해야 함) */

update EMPLOYEE
set superssn = NULL
where ssn in (select e.ssn from EMPLOYEE e, EMPLOYEE s where s.fname = 'James' and s.lname = 'Borg' and e.superssn = s.ssn);

## Nested Query

## LAB 12: James의 부하 직원의 이름은? 중첩질의 사용

In [ ]:
%%sql

select lname, fname
from EMPLOYEE
where superssn
         = (select ssn
             from EMPLOYEE
             where lname = 'Borg' and fname = 'James')

## LAB 13: Houston에 사무실이 있는 부서명? 중첩질의 사용

In [ ]:
%%sql

select d.dname
from DEPARTMENT d
where d.dnumber in (
  select dl.dnumber
  from DEPT_LOCATIONS dl
  where dl.dlocation = 'Houston'
)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
2 rows affected.

[('Headquarters',), ('Research',)]

## LAB 14: Houston과 Sugarland 모두에 사무실이 있는 부서명? 중첩질의 사용

In [ ]:
%%sql

select d.dname
from DEPARTMENT d
where d.dnumber in (
  select dl.dnumber
  from DEPT_LOCATIONS dl
  where dl.dlocation = 'Houston'
)
and
d.dnumber not in (
  select dl.dnumber
  from DEPT_LOCATIONS dl
  where dl.dlocation = 'Sugarland'
)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('Headquarters',)]

**11/18 DBA**

자신이 소속된 부서의 부서장의 이름?

In [ ]:
%%sql

select e.lname as me, m.lname as manager
from EMPLOYEE e, EMPLOYEE m
where exists (
   select *
   from DEPARTMENT d
   where e.dno = d.dnumber and m.ssn = d.mgrssn

)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('Smith', 'Wong'),
 ('Wong', 'Wong'),
 ('English', 'Wong'),
 ('Narayan', 'Wong'),
 ('Borg', 'Borg'),
 ('Wallace', 'Wallace'),
 ('Jabbar', 'Wallace'),
 ('Zelaya', 'Wallace')]

In [ ]:
%%sql

select e.lname, m.lname
from EMPLOYEE e, EMPLOYEE m
where exists (
  select * 
  from DEPARTMENT d 
  where e.dno = d.dnumber and m.ssn = d.mgrssn)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('Smith', 'Wong'),
 ('Wong', 'Wong'),
 ('English', 'Wong'),
 ('Narayan', 'Wong'),
 ('Borg', 'Borg'),
 ('Wallace', 'Wallace'),
 ('Jabbar', 'Wallace'),
 ('Zelaya', 'Wallace')]

## LAB 15: 자신이 소속된 부서에서 최고 급여를 받는 직원의 이름은?

In [ ]:
%%sql

select e.lname
from EMPLOYEE e
where not exists (select * from EMPLOYEE f where e.dno = f.dno and e.salary < f.salary)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
3 rows affected.

[('Wong',), ('Borg',), ('Wallace',)]

In [ ]:
%%sql

select lname
from EMPLOYEE e
where salary >=all   (select salary from EMPLOYEE f where e.dno = f.dno)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
3 rows affected.

[('Wong',), ('Borg',), ('Wallace',)]

In [ ]:
%%sql

select e.lname, e.fname
from EMPLOYEE e
where not exists (select * from EMPLOYEE where salary > e.salary)

In [ ]:
%%sql

select lname, fname
from EMPLOYEE e
where (e.salary  <ANY   (select salary from EMPLOYEE))

## LAB 16: 최고 급여가 아닌 사람은?

In [ ]:
%%sql

select lname, fname
from EMPLOYEE e
where (e.salary  <ANY   (select salary from EMPLOYEE))

## LAB 17: 상관 중첩 질의: 자신의 부서에서 최고 급여를 받는 직원의 이름과 부서명은?

In [ ]:
%%sql

select d.dname, e.lname, e.fname
from EMPLOYEE e, DEPARTMENT d
where e.dno = d.dnumber and (e.salary  >=ALL  (select f.salary from EMPLOYEE f where e.dno = f.dno))

## LAB 18: James Borg의 부하직원의 이름은? (EXISTS 사용)

In [ ]:
%%sql

select e.lname, e.fname
from EMPLOYEE e
where exists (
    select * 
    from EMPLOYEE j
    where e.superssn = j.ssn and j.lname = 'Borg' and j.fname = 'James'
)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
2 rows affected.

[('Wong', 'Franklin'), ('Wallace', 'Jennifer')]

## LAB 19: Houston과 Sugarland 모두에 office가 있는 부서명은? (EXISTS 사용)

In [ ]:
%%sql


select d.dname
from DEPARTMENT d
where 
EXISTS (
   select * 
   from DEPT_LOCATIONS dl
   where d.dnumber = dl.dnumber and dl.dlocation = 'Houston'
)
and
not EXISTS (
   select * 
   from DEPT_LOCATIONS dl
   where d.dnumber = dl.dnumber and dl.dlocation = 'Sugarland'
);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('Headquarters',)]

## LAB 20: ProductX에 참여하지 않는 직원의 이름은?

In [ ]:
%%sql

select e.fname, e.lname
from EMPLOYEE e
where NOT EXISTS 
(
   select * 
   from WORKS_ON w, PROJECT p
   where e.ssn = w.essn and w.pno = p.pnumber and p.pname = 'ProductX'
);

부양가족이 없는 관리자의 lname?

In [ ]:
%%sql

select e.lname
from EMPLOYEE e
where
EXISTS 
(
   select * 
   from DEPARTMENT d
   where d.mgrssn = e.Ssn
)
and NOT EXISTS
(
   select * 
   from DEPENDENT d
   where d.Essn = e.Ssn
)

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
(pymysql.err.ProgrammingError) (1146, "Table 's202100001db.DEPENDENT' doesn't exist")
[SQL: select e.lname
from EMPLOYEE e
where
EXISTS
(
   select *
   from DEPARTMENT d
   where d.mgrssn = e.Ssn
)
and NOT EXISTS
(
   select *
   from DEPENDENT d
   where d.Essn = e.Ssn
)]
(Background on this error at: https://sqlalche.me/e/14/f405)

## LAB 21: 4번 부서가 담당하는 모든 프로젝트에 참여하는 사원들의 이름은?

In [ ]:
%%sql

select e.fname, e.lname
from EMPLOYEE e
where
NOT EXISTS (
   select * 
   from PROJECT p
   where 
      dnum = 4
      and
      NOT EXISTS (
         select *
         from WORKS_ON w
         where w.pno = p.pnumber and w.essn = e.ssn
      )
);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
2 rows affected.

[('Ahmad', 'Jabbar'), ('Alicia', 'Zelaya')]

## LAB 22: Administration 부서의 모든 직원이 참여하는 프로젝트 이름은?

In [ ]:
%%sql

select p.pname
from PROJECT p 
where not exists (
   select *
   from EMPLOYEE e, DEPARTMENT d
   where e.dno = d.dnumber and d.dname = 'Administration' and not exists (
     select *
     from WORKS_ON w
     where p.pnumber = w.pno and e.ssn = w.essn
   )
)

## LAB 23 직원과 직원의 상사가 있다면 그 상사의 이름들을 나열하시오.

In [ ]:
%%sql

select e.fname, e.lname, s.fname as supervisor_fname, s.lname as supervisor_lname
from EMPLOYEE e left outer join EMPLOYEE s on e.superssn = s.ssn;

## TRY JOIN, LEFT OUTER JOIN, RIGHT OUTER JOIN, CROSS JOIN FOR YOURSELF

In [ ]:
%%sql

select * from (DEPARTMENT natural join DEPT_LOCATIONS);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
5 rows affected.

[(1, 'Headquarters', '888665555', datetime.date(1981, 6, 19), 'Houston'),
 (4, 'Administration', '987654321', datetime.date(1995, 1, 1), 'Stafford'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Bellaire'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Houston'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Sugarland')]

### Oracle, MySQL에서 from 절에 select 사용하기.

In [ ]:
%%sql

select e.fname, e.lname
from (select * from EMPLOYEE where dno = 5) e
where e.salary >= 30000;

### 위를 흉내내서 Research 부서의 부서장의 이름은? outer select 문에 where 절 없이 작성

In [ ]:
%%sql

select e.fname, e.lname
from (select * from DEPARTMENT where dname = 'Research') m 
     join 
     EMPLOYEE e 
     on e.ssn = m.mgrssn;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('Franklin', 'Wong')]

## LAB 24: 최대급여를 받는 직원의 이름은? (Use aggregate function)

In [ ]:
%%sql

select fname, lname
from EMPLOYEE 
where salary = (select max(salary) from EMPLOYEE);

## LAB 25: 부서별 최대급여를 받는 직원의 이름은? (Use aggregate function)

In [ ]:
%%sql

select fname, lname
from EMPLOYEE e
where salary = (select max(salary) from EMPLOYEE where dno = e.dno);

## LAB 26: 2개의 PROJECT에 참여하는 직원의 이름은?

In [ ]:
%%sql

## LAB 27: 모든 PROJECT에 참여하는 직원의 이름은? (Using count; Never recommended)

Note: PK/FK 제약 조건에 의존하여 성립되는 질의임

In [ ]:
%%sql

## LAB 28: 직원별 참여 프로젝트 수는?

In [ ]:
%%sql

select hours, count(*)
from WORKS_ON, EMPLOYEE
where ssn = essn
group by ssn

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
(pymysql.err.OperationalError) (1055, "Expression #1 of SELECT list is not in GROUP BY clause and contains nonaggregated column 's202100001db.WORKS_ON.Hours' which is not functionally dependent on columns in GROUP BY clause; this is incompatible with sql_mode=only_full_group_by")
[SQL: select hours, count(*)
from WORKS_ON, EMPLOYEE
where ssn = essn
group by ssn]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%%sql

## LAB 29: 부양가족수가 2 이상 직원의 이름은?

In [ ]:
%%sql

select lname, fname
from DEPENDENT, EMPLOYEE
where ssn = essn
group by ssn, lname, fname
having count(*) >= 2

## Creating Trigger: MySQL syntax

```
CREATE
    [DEFINER = { user | CURRENT_USER }]
    TRIGGER trigger_name
    trigger_time trigger_event
    ON tbl_name FOR EACH ROW
    trigger_body

trigger_time: { BEFORE | AFTER }

trigger_event: { INSERT | UPDATE | DELETE }
```

In [ ]:
%sql drop table if exists salary_audit;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

create table salary_audit (
  essn char(9),
  before_salary decimal(10,2),
  after_salary decimal(10,2),
  udatetime datetime
);

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%sql drop trigger if exists salary_audit_trig

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

create trigger salary_audit_trig
after update
on EMPLOYEE
for each row
begin
if new.salary <> old.salary then
	insert into salary_audit values (new.ssn, old.salary, new.salary, now());
end if;
end

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

update EMPLOYEE set salary = salary * 1.1 where dno = 5

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
4 rows affected.

[]

In [ ]:
%sql select * from salary_audit;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
4 rows affected.

[('123456789', Decimal('33000.00'), Decimal('36300.00'), datetime.datetime(2021, 11, 25, 12, 16, 38)),
 ('333445555', Decimal('44000.00'), Decimal('48400.00'), datetime.datetime(2021, 11, 25, 12, 16, 38)),
 ('453453453', Decimal('27500.00'), Decimal('30250.00'), datetime.datetime(2021, 11, 25, 12, 16, 38)),
 ('666884444', Decimal('41800.00'), Decimal('45980.00'), datetime.datetime(2021, 11, 25, 12, 16, 38))]

In [ ]:
%sql select * from EMPLOYEE

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('36300.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('48400.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('30250.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('45980.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

**11/25 DBA** PSM 설명

### Test if stored procedure works

In [ ]:
%sql drop procedure if exists p1;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

create procedure p1()
    select 'Hello World';

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
(pymysql.err.OperationalError) (1304, 'PROCEDURE p1 already exists')
[SQL: create procedure p1()
    select 'Hello World';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%sql call p1()

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('Hello World',)]

## Views

In [ ]:
%sql drop view if exists WORKS_ON1;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

CREATE VIEW WORKS_ON1 
AS
SELECT  FNAME, LNAME, PNAME, HOURS
FROM    EMPLOYEE, PROJECT, WORKS_ON
WHERE   SSN=ESSN AND PNO=PNUMBER;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
0 rows affected.

[]

In [ ]:
%%sql

SELECT FNAME, LNAME 
FROM   WORKS_ON1
WHERE  PNAME='ProductX';

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
2 rows affected.

[('John', 'Smith'), ('Joyce', 'English')]

In [ ]:
%sql select LNAME,SALARY from EMPLOYEE where SSN = 123456789

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('Smith', Decimal('36300.00'))]

In [ ]:
%%sql

SELECT  table_name, is_updatable
FROM    information_schema.views

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
1 rows affected.

[('WORKS_ON1', 'YES')]

### Derived Table

In [ ]:
%%sql

/* derived table */
select dname, lname, fname
from (select ssn, lname, fname, dno from EMPLOYEE where sex = 'M') e 
     join DEPARTMENT on dno = dnumber

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
5 rows affected.

[('Research', 'Smith', 'John'),
 ('Research', 'Wong', 'Franklin'),
 ('Research', 'Narayan', 'Ramesh'),
 ('Headquarters', 'Borg', 'James'),
 ('Administration', 'Jabbar', 'Ahmad')]

### Common Table Expression(CTE)

In [ ]:
%%sql

WITH first_level AS (
      SELECT ssn
      FROM EMPLOYEE WHERE superssn = '888665555'
    ),
    second_level AS (
      SELECT e.ssn
      FROM EMPLOYEE e JOIN first_level f ON f.ssn = e.superssn
    )
SELECT * FROM first_level UNION ALL SELECT * FROM second_level

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
7 rows affected.

[('333445555',),
 ('987654321',),
 ('123456789',),
 ('453453453',),
 ('666884444',),
 ('987987987',),
 ('999887777',)]

### Recursive Common Table Expression(CTE)

In [ ]:
%%sql

WITH RECURSIVE supervisees (essn) 
AS (
      SELECT '888665555'
      UNION ALL
      SELECT ssn 
      FROM EMPLOYEE, supervisees 
      WHERE superssn = essn
    )
SELECT essn 
FROM supervisees;

 * mysql+pymysql://s202100001:***@dm.hufs.ac.kr:3306/s202100001db
8 rows affected.

[('888665555',),
 ('333445555',),
 ('987654321',),
 ('123456789',),
 ('453453453',),
 ('666884444',),
 ('987987987',),
 ('999887777',)]

In [ ]:
userName = "' OR '1'='1"
userName = "'; drop dataabase xxx cascade"
statement = "SELECT * FROM users WHERE name = '" + userName + "';"
print(statement)

SELECT * FROM users WHERE name = '' OR '1'='1';